{"config": [{"config": {"kernel_constraint": null, "filters": 5, "activation": "relu", "strides": [1, 1, 1], "bias_regularizer": null, "padding": "same", "dilation_rate": [1, 1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_in", "scale": 2.0, "seed": 3}, "class_name": "VarianceScaling"}, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-06}, "class_name": "L1L2"}, "name": "conv3d_1", "kernel_size": [3, 3, 3], "data_format": "channels_last", "batch_input_shape": [null, 160, 200, 170, 1], "bias_constraint": null, "use_bias": true, "trainable": true}, "class_name": "Conv3D"}, {"config": {"data_format": "channels_last", "name": "max_pooling3d_1", "strides": [2, 2, 2], "padding": "valid", "trainable": true, "pool_size": [2, 2, 2]}, "class_name": "MaxPooling3D"}, {"config": {"kernel_constraint": null, "filters": 10, "activation": "relu", "strides": [1, 1, 1], "bias_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_in", "scale": 2.0, "seed": 3}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-06}, "class_name": "L1L2"}, "name": "conv3d_2", "kernel_size": [3, 3, 3], "bias_constraint": null, "dilation_rate": [1, 1, 1], "trainable": true}, "class_name": "Conv3D"}, {"config": {"data_format": "channels_last", "name": "max_pooling3d_2", "strides": [2, 2, 2], "padding": "valid", "trainable": true, "pool_size": [2, 2, 2]}, "class_name": "MaxPooling3D"}, {"config": {"kernel_constraint": null, "filters": 20, "activation": "relu", "strides": [1, 1, 1], "bias_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_in", "scale": 2.0, "seed": 3}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-06}, "class_name": "L1L2"}, "name": "conv3d_3", "kernel_size": [3, 3, 3], "bias_constraint": null, "dilation_rate": [1, 1, 1], "trainable": true}, "class_name": "Conv3D"}, {"config": {"data_format": "channels_last", "name": "max_pooling3d_3", "strides": [2, 2, 2], "padding": "valid", "trainable": true, "pool_size": [2, 2, 2]}, "class_name": "MaxPooling3D"}, {"config": {"kernel_constraint": null, "filters": 40, "activation": "relu", "strides": [1, 1, 1], "bias_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_in", "scale": 2.0, "seed": 3}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-06}, "class_name": "L1L2"}, "name": "conv3d_4", "kernel_size": [3, 3, 3], "bias_constraint": null, "dilation_rate": [1, 1, 1], "trainable": true}, "class_name": "Conv3D"}, {"config": {"data_format": "channels_last", "name": "max_pooling3d_4", "strides": [2, 2, 2], "padding": "valid", "trainable": true, "pool_size": [2, 2, 2]}, "class_name": "MaxPooling3D"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "bias_regularizer": null, "units": 64, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_in", "scale": 2.0, "seed": 3}, "class_name": "VarianceScaling"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-06}, "class_name": "L1L2"}, "name": "dense_1", "bias_constraint": null, "use_bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"axis": -1, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "name": "batch_normalization_1", "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"noise_shape": null, "rate": 0.5, "trainable": true, "name": "dropout_1", "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "bias_regularizer": null, "units": 64, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_in", "scale": 2.0, "seed": 3}, "class_name": "VarianceScaling"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-06}, "class_name": "L1L2"}, "name": "dense_2", "bias_constraint": null, "use_bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"axis": -1, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "center": true, "name": "batch_normalization_2", "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": true}, "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"noise_shape": null, "rate": 0.5, "trainable": true, "name": "dropout_2", "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "bias_regularizer": null, "units": 3, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 9.999999747378752e-06}, "class_name": "L1L2"}, "name": "dense_3", "bias_constraint": null, "use_bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_3", "trainable": true}, "class_name": "Activation"}], "keras_version": "2.2.0", "backend": "tensorflow", "class_name": "Sequential"}